RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_01.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>BLE</name>
      <description>Bluetooth Low Energy Subsystem</description>
      <baseAddress>0x403C0000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>131072</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <cluster>
          <name>RCB</name>
          <description>Radio Control Bus (RCB) controller</description>
          <addressOffset>0x00000000</addressOffset>
          <register>
            <name>CTRL</name>
            <description>RCB control register.</description>
            <addressOffset>0x0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xF80000</resetValue>
            <resetMask>0x80FFFF3E</resetMask>
            <fields>
              <field>
                <name>TX_CLK_EDGE</name>
                <description>Clock edge used for transmitting (Transmision uses internal core clock)
0: Negative Edge (Default)
1: Positive Edge</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_CLK_EDGE</name>
                <description>Clock edge used for sampling the received data (Sampling uses clock selected by RX_CLK_SRC)
0: Negative Edge (Default)
1: Positive Edge 
Note: For RX_CLK_SRC =1, when pad clock is used as sampling clock, this field is ignored</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_CLK_SRC</name>
                <description>Clock to be used for sampling the received data
0: Internal clock  (Default)
1: Clock from the SCK pad 

When Clock from the SCK pad is used, sampling is always on negedge only</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLK_CONTINUOUS</name>
                <description>Controls the behaviour of the RCB clock
'0': SCLK is generated, only when the RCB controller is enabled and data is transmitted.
'1': SCLK is generated, when the RCB controller is enabled.</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SSEL_POLARITY</name>
                <description>Slave select polarity. SSEL_POLARITY applies to the outgoing slave select signal 
'0': slave select is low/'0' active.
'1': slave select is high/'1' active.</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LEAD</name>
                <description>N/A</description>
                <bitRange>[9:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LAG</name>
                <description>N/A</description>
                <bitRange>[11:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIV_ENABLED</name>
                <description>Enable for RCB Clock Divider.
The internal core clock divider is bypassed when DIV_ENABLED=0</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIV</name>
                <description>The internal core clock divider factor when DIV_ENABLED=1
Divider factor: 2*DIV. Max DIV value supported is 31.
DIV value of zero is not supported. Make DIV_ENABLED=0 for undivided clock</description>
                <bitRange>[18:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADDR_WIDTH</name>
                <description>Width of Address phase (includes read/write mode bit) of the Dataframe width. ADDR_WIDTH + 1 is the amount of bits in a transmitted data frame. Allowed legal values are 'd8, 'd10 and 'd15</description>
                <bitRange>[22:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_WIDTH</name>
                <description>Width of Data phase of the transmit Dataframe width. 
0 - 8 bits
1 - 16 bits</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ENABLED</name>
                <description>IP enabled ('1') or not ('0'). The proper order in which to initialize the IP is as follows:
- Program protocol specific information using CTRL except ENABLED field. 
- Program generic transmitter (TX_CTRL) and receiver (RX_CTRL) information. This includes enabling of the transmitter and receiver functionality.
- Program transmitter FIFO (TX_FIFO_CTRL) and receiver FIFO (RX_FIFO_CTRL) information.
- Program CTRL to enable IP.
When the IP is enabled, no control information should be changed. Changes should be made AFTER disabling the IP, e.g. to modify the edges, dividers. The change takes effect after the IP is re-enabled. Note that disabling the IP will cause re-initialization of the design and associated state is lost (e.g. FIFO content).</description>
                <bitRange>[31:31]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>STATUS</name>
            <description>RCB status register.</description>
            <addressOffset>0x4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>BUS_BUSY</name>
                <description>RCB bus is busy. The bus is considered busy ('1') during an ongoing transaction.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_CTRL</name>
            <description>Transmitter control register.</description>
            <addressOffset>0x10</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x21</resetValue>
            <resetMask>0x7F</resetMask>
            <fields>
              <field>
                <name>MSB_FIRST</name>
                <description>Least significant bit first ('0') or most significant bit first ('1').
This field also affects the Address field
When MSB_FIRST = 1, then [15:0] is data and [(ADDR_WIDTH+15):16] is used for address 
When MSB_FIRST = 0, then [15:0] is for data. No address field</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>FIFO_RECONFIG</name>
                <description>Setting this bit, clears the FIFO and resets the pointer</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_ENTRIES</name>
                <description>This field determines the depth of the TX_FIFO. Allowed legal values are 8 and 16 only</description>
                <bitRange>[6:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_FIFO_CTRL</name>
            <description>Transmitter FIFO control register.</description>
            <addressOffset>0x14</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1001F</resetMask>
            <fields>
              <field>
                <name>TX_TRIGGER_LEVEL</name>
                <description>Trigger level. When the transmitter FIFO has less entries than the number of this field, a transmitter trigger event is generated.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLEAR</name>
                <description>When '1', the transmitter FIFO and transmitter shift register are cleared/invalidated. Invalidation will last for as long as this field is '1'. If a quick clear/invalidation is required, the field should be set to '1' and be followed by a set to '0'. If a clear/invalidation is required for an extended time period, the field should be set to '1' during the complete time period.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_FIFO_STATUS</name>
            <description>Transmitter FIFO status register.</description>
            <addressOffset>0x18</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF0F801F</resetMask>
            <fields>
              <field>
                <name>USED</name>
                <description>Amount of enties in the transmitter FIFO. The value of this field ranges from 0 to 16</description>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SR_VALID</name>
                <description>Indicates whether the TX shift registers holds a valid data frame ('1') or not ('0'). The shift register can be considered the top of the TX FIFO (the data frame is not included in the USED field of the TX FIFO). The shift register is a working register and holds the data frame that is currently transmitted (when the protocol state machine is transmitting a data frame) or the data frame that is tranmitted next (when the protocol state machine is not transmitting a data frame).</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_PTR</name>
                <description>FIFO read pointer: FIFO location from which a data frame is read by the hardware.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_PTR</name>
                <description>FIFO write pointer: FIFO location at which a new data frame is written.</description>
                <bitRange>[27:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_FIFO_WR</name>
            <description>Transmitter FIFO write register.</description>
            <addressOffset>0x1C</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data frame written into the transmitter FIFO. Behavior is similar to that of a PUSH operation. 
A write to a full TX FIFO sets INTR_TX.OVERFLOW to '1'.</description>
                <bitRange>[31:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_CTRL</name>
            <description>Receiver control register.</description>
            <addressOffset>0x20</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x1</resetValue>
            <resetMask>0x1</resetMask>
            <fields>
              <field>
                <name>MSB_FIRST</name>
                <description>Least significant bit first ('0') or most significant bit first ('1').
This field also affects the Address field
When MSB_FIRST = 1, then [15:0] is data and [(ADDR_WIDTH+15):16] is used for address 
When MSB_FIRST = 0, then [15:0] is for data. No address field</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_CTRL</name>
            <description>Receiver FIFO control register.</description>
            <addressOffset>0x24</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1000F</resetMask>
            <fields>
              <field>
                <name>TRIGGER_LEVEL</name>
                <description>Trigger level. When the receiver FIFO has more entries than the number of this field, a receiver trigger event is generated.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CLEAR</name>
                <description>When '1', the receiver FIFO and receiver shift register are cleared/invalidated. Invalidation will last for as long as this field is '1'. If a quick clear/invalidation is required, the field should be set to '1' and be followed by a set to '0'. If a clear/invalidation is required for an extended time period, the field should be set to '1' during the complete time period.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_STATUS</name>
            <description>Receiver FIFO status register.</description>
            <addressOffset>0x28</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF0F801F</resetMask>
            <fields>
              <field>
                <name>USED</name>
                <description>Amount of enties in the receiver FIFO. The value of this field ranges from 0 to FF_DATA_NR.</description>
                <bitRange>[4:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>SR_VALID</name>
                <description>Indicates whether the RX shift registers holds a (partial) valid data frame ('1') or not ('0'). The shift register can be considered the bottom of the RX FIFO (the data frame is not included in the USED field of the RX FIFO). The shift register is a working register and holds the data frame that is currently being received (when the protocol state machine is receiving a data frame).</description>
                <bitRange>[15:15]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RD_PTR</name>
                <description>FIFO read pointer: FIFO location from which a data frame is read.</description>
                <bitRange>[19:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>WR_PTR</name>
                <description>FIFO write pointer: FIFO location at which a new data frame is written by the hardware.</description>
                <bitRange>[27:24]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_RD</name>
            <description>Receiver FIFO read register.</description>
            <addressOffset>0x2C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data read from the receiver FIFO. Reading a data frame will remove the data frame from the FIFO; i.e. behavior is similar to that of a POP operation. 
During debug it may be required to read the FIFO without a corresponding POP of the FIFO. This can be achieved by using the RX_FIFO_RD_SILENT register

