RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_01.svd
A read from an empty RX FIFO sets INTR_RX.UNDERFLOW to '1'.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>RX_FIFO_RD_SILENT</name>
            <description>Receiver FIFO read register.</description>
            <addressOffset>0x30</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x0</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>Data read from the receiver FIFO. Reading a data frame will NOT remove the data frame from the FIFO; i.e. behavior is similar to that of a PEEK operation.
A read from an empty RX FIFO sets INTR_RX.UNDERFLOW to '1'.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR</name>
            <description>Master interrupt request register.</description>
            <addressOffset>0x40</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x600</resetValue>
            <resetMask>0x1F1F01</resetMask>
            <fields>
              <field>
                <name>RCB_DONE</name>
                <description>RCB Controller transfer done event. On completion of every RCB transaction, this bit is set</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Less entries in the TX FIFO than the value specified by TX_FIFO_CTRL.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_NOT_FULL</name>
                <description>TX FIFO is not full. entries != TX_ENTRIES</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_EMPTY</name>
                <description>TX FIFO is empty; i.e. it has 0 entries.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_OVERFLOW</name>
                <description>Attempt to write to a full TX FIFO.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_UNDERFLOW</name>
                <description>Attempt to read from an empty TX FIFO. This happens when the IP is ready to transfer data and EMPTY is '1'.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>More entries in the RX FIFO than the value specified by TRIGGER_LEVEL in RX_FIFO_CTL.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_NOT_EMPTY</name>
                <description>RX FIFO is not empty.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_FULL</name>
                <description>RX FIFO is full. Note that received data frames are lost when the RX FIFO is full.  entries == (16-TX_ENTRIES_</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_OVERFLOW</name>
                <description>Attempt to write to a full RX FIFO.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_UNDERFLOW</name>
                <description>Attempt to read from an empty RX FIFO.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_SET</name>
            <description>Master interrupt set request register</description>
            <addressOffset>0x44</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x600</resetValue>
            <resetMask>0x1F1F01</resetMask>
            <fields>
              <field>
                <name>RCB_DONE</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_NOT_FULL</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_EMPTY</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_OVERFLOW</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_UNDERFLOW</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_NOT_EMPTY</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_FULL</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_OVERFLOW</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_UNDERFLOW</name>
                <description>Write with '1' to set corresponding bit in interrupt request register.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASK</name>
            <description>Master interrupt mask register.</description>
            <addressOffset>0x48</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F1F01</resetMask>
            <fields>
              <field>
                <name>RCB_DONE</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_NOT_FULL</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_EMPTY</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_OVERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TX_FIFO_UNDERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_NOT_EMPTY</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_FULL</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_OVERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_FIFO_UNDERFLOW</name>
                <description>Mask bit for corresponding bit in interrupt request register.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>INTR_MASKED</name>
            <description>Master interrupt masked request register</description>
            <addressOffset>0x4C</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1F1F01</resetMask>
            <fields>
              <field>
                <name>RCB_DONE</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_TRIGGER</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_NOT_FULL</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[9:9]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_EMPTY</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[10:10]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_OVERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>TX_FIFO_UNDERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[12:12]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_TRIGGER</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_NOT_EMPTY</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[17:17]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_FULL</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_OVERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>RX_FIFO_UNDERFLOW</name>
                <description>Logical and of corresponding request and mask bits.</description>
                <bitRange>[20:20]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <cluster>
            <name>RCBLL</name>
            <description>Radio Control Bus (RCB) &amp; Link Layer controller</description>
            <addressOffset>0x00000100</addressOffset>
            <register>
              <name>CTRL</name>
              <description>RCB LL control register.</description>
              <addressOffset>0x0</addressOffset>
              <size>32</size>
              <access>read-write</access>
              <resetValue>0x0</resetValue>
              <resetMask>0x3F</resetMask>
              <fields>
                <field>
                  <name>RCBLL_CTRL</name>
                  <description>RCB register access control
0: RCB registers can be accessed by CPU
1: RCB registers can be accessed by BLE Link Layer.

