RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_01.svd
          <register>
            <name>CONN_CE_COUNTER</name>
            <description>connection event counter</description>
            <addressOffset>0x124</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONNECTION_EVENT_COUNTER</name>
                <description>This is the free running counter, connEventCounter as defined by Bluetooth spec.
Firmware will read the instantaneous Event counter from this register, during connection update and channel map update procedure. Firmware will use this value to calculate the instant from which the new parameters (for connection update and channel map update) will be effective.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA_LIST_SENT_UPDATE__STATUS</name>
            <description>data list sent update and status</description>
            <addressOffset>0x128</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x8F</resetMask>
            <fields>
              <field>
                <name>LIST_INDEX__TX_SENT_3_0</name>
                <description>Write:Indicates the buffer index for which the SENT bit is being updated by firmware.
The default number of buffers in the IP is 4. The index range is 0-3.

Read: Reads TX_SENT[3:0].
The bits in this field indicate the status of the SENT bit in the hard-ware for each packet buffer. The bit values are
1 - queued
0 - no packet / packet ack received by hardware 
Example1: If the read value is : 0x03, then packets in buffer 0 and buffer 1 are in the queue to be transmitted. All the other FIFOs are empty or hardware has cleared them after receiving acknowledgement.
NOTE:
The SENT status bit and ACK status bit have to be taken together to understand the meaning of packet status. The table below describes how the two bits are sequentially updated by either hardware/firmware to complete one data transmission.
SENT ACK  Description
0         0      Buffer is empty. No packet is queued in the buffer
1         0      Packet is queued by firmware.
1         1      Packet is transmitted by hardware. Hardware is waiting for acknowledgement.
0         1      Hardware has received ACK. Firmware has not yet processed the ACK.
0         0      Firmware has processed the ack. The buffer is again empty.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SET_CLEAR</name>
                <description>Write: Used to set the SENT bit in hardware for the selected packet buffer.
1 - packet queued
When firmware has a packet to send, firmware first loads the next available packet buffer. Then the hardware SENT bit is set by writing 1 to this bit field along with the list_index field that identified the buffer index.  This indicates that a packet has been queued in the data buffer for sending. This packet is now ready to be transmitted. 
The SENT bit in hardware is cleared by hardware only when it has received an acknowledgement from the remote device. 
Firmware typically does not clear the bit. However, It only clears the bit on its own if it needs to 'flush' a packet from the buffer, without waiting to receive acknowledgement from the remote device, firmware clears BIT7 along with the list_index specified.</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DATA_LIST_ACK_UPDATE__STATUS</name>
            <description>data list ack update and status</description>
            <addressOffset>0x12C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x8F</resetMask>
            <fields>
              <field>
                <name>LIST_INDEX__TX_ACK_3_0</name>
                <description>Write: Indicates the buffer index for which the ACK bit is being updated by firmware.
The default number of buffers in the IP is 5. The index range is 0-4.

Read: Reads TX_ACK[3:0]
If a particular bit is set, then the packet in the selected buffer has been transmitted (at least once) by the hardware and hardware is waiting for acknowledgement. 
Example1 : If the read value is : 0x03, then packets in FIFO-0 and FIFO-1 are acknowledged by the remote device. These acknowledgements are pending to be processed by firmware.
Example2 : If the read value is : 0x02, then packet FIFO-1 is acknowledged by the remote device. This acknowledgement is pending to be processed by firmware.
NOTE:
The SENT status bit and ACK status bit have to be taken together to understand the meaning of packet status. The table below describes how the two bits are sequentially updated by either hardware/firmware to complete one data transmission.
SENT ACK  Description
0         0      Buffer is empty. No packet is queued in the buffer
1         0      Packet is queued by firmware.
1         1      Packet is transmitted by hardware. Hardware is waiting for acknowledgement.
0         1      Hardware has received ACK. Firmware has not yet processed the ACK.
0         0      Firmware has processed the ack. The buffer is again empty.</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SET_CLEAR</name>
                <description>Write: Firmware uses the field to clear and ACK bit in the hardware to indicate that the acknowledgement for the transmit packet has been received and processed by firmware.
Firmware clears the ACK bit in the hardware by writing in this register only after the acknowledgement is processed successfully by firmware.
For clearing ack for a packet transmitted in fifo-index : '3', firm-ware will write '3' in the 'list-index' field and set this bit (BIT7) to 0. 
This is the indication that the corresponding packet buffer identi-fied by List-Index is cleared of previous transmission and can be re-used for another packet from now on.
The ACK bit in hardware is set by hardware when it has success-fully transmitted a packet.</description>
                <bitRange>[7:7]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CE_CNFG_STS_REGISTER_EXT</name>
            <description>connection configuration &amp; status register</description>
            <addressOffset>0x130</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3F0F</resetMask>
            <fields>
              <field>
                <name>TX_2M</name>
                <description>transmittion on 2M</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RX_2M</name>
                <description>receiving on 2M</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SN</name>
                <description>Sequence number for next scheduled connection index</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>NESN</name>
                <description>Next Sequence number for next scheduled connection index</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LAST_UNMAPPED_CHANNEL</name>
                <description>Last unmapped channel for next scheduled connection index</description>
                <bitRange>[13:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_EXT_INTR</name>
            <description>Connection extended interrupt status and Clear register</description>
            <addressOffset>0x134</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>DATARATE_UPDATE</name>
                <description>If this bit is set it indicates that the data rate is updated
If this bit is written with 1, it clears the interrupt status bit</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EARLY_INTR</name>
                <description>For master this bit is set on start_ce
For Slave this bit is set on slave_timer_adj</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GEN_TIMER_INTR</name>
                <description>If this bit is set it indicates that the generic timer (PDU response timer reconfigured in MMMS mode) has expired
If this bit is written with 1, it clears the interrupt status bit</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_EXT_INTR_MASK</name>
            <description>Connection Extended Interrupt mask</description>
            <addressOffset>0x138</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>DATARATE_UPDATE</name>
                <description>If this bit is set connection data rate update interrupt is enabled.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EARLY_INTR</name>
                <description>If this bit is set connection early interrupt is enabled.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>GEN_TIMER_INTR</name>
                <description>Generic timer (PDU response timer reconfigured in MMMS mode) expiry interrupt</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>5</dim>
            <dimIncrement>4</dimIncrement>
            <name>DATA_MEM_DESCRIPTOR[%s]</name>
            <description>Data buffer descriptor 0 to 4</description>
            <addressOffset>0x140</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3FF</resetMask>
            <fields>
              <field>
                <name>LLID</name>
                <description>N/A</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DATA_LENGTH</name>
                <description>This field indicates the length of the data packet. Bits [9:7] are valid only if DLE is set.
Range 0x00 to 0xFF.</description>
                <bitRange>[9:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WINDOW_WIDEN_INTVL</name>
            <description>Window widen for interval</description>
            <addressOffset>0x160</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xA</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>WINDOW_WIDEN_INTVL</name>
                <description>This value defines the increased listening time for the slave.
The window widening  shall be smaller than ((connInterval/2)-T_IFS us)
This value is calculated by firmware based on the drift, the connec-tion interval value. The value is the unit widening value for one con-nection interval duration. In case of slave latency, this value is accu-mulated till the next anchor point at which the slave will listen.</description>
                <bitRange>[11:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>WINDOW_WIDEN_WINOFF</name>
            <description>Window widen for offset</description>
            <addressOffset>0x164</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xA</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>WINDOW_WIDEN_WINOFF</name>
                <description>This field stores the additional number of microseconds the slave must extend its listening window to listen for a master packet. This value is calculated based on the window offset value. This is used at connection setup directly. During connection setup, this value is added with window_widen_intvl register value to calculate the win-dow widening size.</description>
                <bitRange>[11:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LE_RF_TEST_MODE</name>
            <description>Direct Test Mode control</description>
            <addressOffset>0x170</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xA3FF</resetMask>
            <fields>
              <field>
                <name>TEST_FREQUENCY</name>
                <description>N = (F - 2402) / 2
Range: 0x00 - 0x27. Frequency Range : 2402 MHz to 2480 MHz</description>
                <bitRange>[5:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DTM_STATUS__DTM_CONT_RXEN</name>
                <description>This bit is overloaded.
The read operation returns the staus of the DTM
1 - DTM test ON
0 - DTM test OFF
The write operation contrls the DTM RX mode
0: DTM run at normal DTMRX  burst mode
1: DTM run at continuous RX DTM mode</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PKT_PAYLOAD</name>
                <description>N/A</description>
                <bitRange>[9:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DTM_CONT_TXEN</name>
                <description>0: DTM run at normal DTMTX  burst mode
1: DTM run at continuous TX DTM mode</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DTM_DATA_2MBPS</name>
                <description>0: DTM run at 1M bps data rate
1: DTM run at 2M bps data rate</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DTM_RX_PKT_COUNT</name>
            <description>Direct Test Mode receive packet count</description>
            <addressOffset>0x174</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RX_PACKET_COUNT</name>
                <description>Number of packets received in receive test mode.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>LE_RF_TEST_MODE_EXT</name>
            <description>Direct Test Mode control</description>
            <addressOffset>0x178</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>DTM_PACKET_LENGTH</name>
                <description>DTM TX packet length.
Bits [7:6] are accessible onle when DLE is enabled</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TXRX_HOP</name>
            <description>Channel Address register</description>
            <addressOffset>0x188</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7F7F</resetMask>
            <fields>
              <field>
                <name>HOP_CH_TX</name>
                <description>Transmit channel index. Channel index on which previous packet is transmitted.</description>
                <bitRange>[6:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HOP_CH_RX</name>
                <description>Receive channel index. Channel index on which previous packet is received.</description>
                <bitRange>[14:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>TX_RX_ON_DELAY</name>
            <description>Transmit/Receive data delay</description>
            <addressOffset>0x190</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>RXON_DELAY</name>
                <description>Receive delay - Delay from start of receive to expected first bit of receive packet at the controller. Used to control the turn on time of radio to optimize on power. The delay is in resolution of 1 microsecond.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>TXON_DELAY</name>
                <description>Transmit delay - Delay from start of transmit to transmission of first bit on air. It is used to control the T_IFS. The delay is in resolution of 1 microsecond.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_ACCADDR_L</name>
            <description>ADV packet access code low word</description>
            <addressOffset>0x1A8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0xBED6</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADV_ACCADDR_L</name>
                <description>Lower 16 bit of ADV packet access code</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_ACCADDR_H</name>
            <description>ADV packet access code high word</description>
            <addressOffset>0x1AC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x8E89</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADV_ACCADDR_H</name>
                <description>higher 16 bit of ADV packet access code</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_CH_TX_POWER_LVL_LS</name>
            <description>Advertising channel transmit power setting</description>
            <addressOffset>0x1B0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>ADV_TRANSMIT_POWER_LVL_LS</name>
                <description>When LL_CONFIG.TX_PA_PWR_LVL_TYPE is 1, this field represents the Advertising channel transmit power setting Least Significant 16 bits.
When LL_CONFIG.TX_PA_PWR_LVL_TYPE is 0, the LS 4 bits  represents the Advertising channel transmit power code 4 bits.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ADV_CH_TX_POWER_LVL_MS</name>
            <description>Advertising channel transmit power setting extension</description>
            <addressOffset>0x1B4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>ADV_TRANSMIT_POWER_LVL_MS</name>
                <description>Advertising channel transmit power setting Most Significant 2 bits.</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>CONN_CH_TX_POWER_LVL_LS</name>
            <description>Connection channel transmit power setting</description>
            <addressOffset>0x1B8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF</resetMask>
            <fields>
              <field>
                <name>CONNCH_TRANSMIT_POWER_LVL_LS</name>
                <description>When LL_CONFIG.TX_PA_PWR_LVL_TYPE is 1, this field represents the Connection channel transmit power setting Least Significant 16 bits.
When LL_CONFIG.TX_PA_PWR_LVL_TYPE is 0, the LS 4 bits  represents the Connection channel transmit power code 4 bits.</description>
                <bitRange>[15:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
