RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_01.svd
          <register>
            <name>MT_CFG</name>
            <description>MT Configuration Register</description>
            <addressOffset>0xA0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x8100000</resetValue>
            <resetMask>0xFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENABLE_BLERD</name>
                <description>This register bit needs to be set to enable CYBLERD55
1'b1 - CYBLERD55 enabled
1'b0 - CYBLERD55 disabled
On power up this bit needs to be set to make CYBLERD55 active.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEEPSLEEP_EXIT_CFG</name>
                <description>This register bit indicates the source for PSoC DeepSleep exit to BLESS
1'b0 - act_power_good from SRSS indicates PSoC DeepSleep exit
1'b1 - MT_CFG.DEEPSLEEP_EXITED indicates PSoC DeepSleep  exit</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEEPSLEEP_EXITED</name>
                <description>This register bit is used by FW to indicate that PSoC is out of DeepSleep
1'b0 - PSoC in DeepSleep
1'b1 - PSoC out of DeepSleep
This bit is cleared by HW on exit from DPSLP</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACT_LDO_NOT_BUCK</name>
                <description>This register bit specifies whether the Active LDO or BUCK in CYBLERD55 is used in active mode</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_HVLDO_BYPASS</name>
                <description>This register should be set to override the HW generated signal to HVLDO. When set HVLDO_BYPASS is driven to the IP</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_BYPASS</name>
                <description>Override value for HVLDO BYPASS
1'b0: bypass the HVLDO
1'b1: Do not bypass the HVLDO</description>
                <bitRange>[5:5]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_ACT_REGULATOR</name>
                <description>This register should be set to override the HW generated signal to enable ACTIVE_LDO/BUCK. When set ACT_REGULATOR_EN is driven to CYBLERD55</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACT_REGULATOR_EN</name>
                <description>Override value for ACT_LDO_EN/BUCK_EN</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_DIG_REGULATOR</name>
                <description>This register should be set to override the HW generated signal to Digital regulator of CYBLERD55. When set DIG_REGULATOR_EN is driven to CYBLERD55</description>
                <bitRange>[8:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIG_REGULATOR_EN</name>
                <description>Override value for digital regulator of CYBLERD55</description>
                <bitRange>[9:9]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_RET_SWITCH</name>
                <description>This register should be set to override the HW generated signal to the retention switch of CYBLERD55. When set OVERRIDE_RET_SWITCH is driven to the IP</description>
                <bitRange>[10:10]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RET_SWITCH</name>
                <description>Override value for RET_SWITCH</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_ISOLATE</name>
                <description>This register should be set to override the HW generated isolation signal to CYBLERD55. When set ISOLATE_N is driven to the IP</description>
                <bitRange>[12:12]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ISOLATE_N</name>
                <description>Override value for isolation to CYBLERD55</description>
                <bitRange>[13:13]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_LL_CLK_EN</name>
                <description>This register should be set to override the HW generated ECO Clock gate. When set LL_CLK_EN is used to gate the clock</description>
                <bitRange>[14:14]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LL_CLK_EN</name>
                <description>Override value for LL Clock gate</description>
                <bitRange>[15:15]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_HVLDO_EN</name>
                <description>This register should be set to override the HW generated enable to HVLSO. When set HVLDO_EN is used.</description>
                <bitRange>[16:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_EN</name>
                <description>Overrie value for HVLDO enable
1'b1: switch to Active LDO
1'b0: switch to standby LDO</description>
                <bitRange>[17:17]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DPSLP_ECO_ON</name>
                <description>This bit when set indicates that ECO clock should be kept on even in BLESS DPSLP. This bit must be toggled only when the Link Layer is active.</description>
                <bitRange>[18:18]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_RESET_N</name>
                <description>This register should be set to override the HW generated reset to CYBLERD55. When set RESET_N is used.</description>
                <bitRange>[19:19]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RESET_N</name>
                <description>Overrie value for CYBLERD55 RESET_N</description>
                <bitRange>[20:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_XTAL_EN</name>
                <description>This register should be set to override the HW generated XTAL_EN to CYBLERD55. When set XTAL_EN is used.</description>
                <bitRange>[21:21]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>XTAL_EN</name>
                <description>Overrie value for CYBLERD55 XTAL_EN</description>
                <bitRange>[22:22]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_CLK_EN</name>
                <description>This register should be set to override the HW generated CLK_EN to CYBLERD55. When set CLK_EN is used.</description>
                <bitRange>[23:23]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>BLERD_CLK_EN</name>
                <description>Overrie value for CYBLERD55 CLK_EN</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>OVERRIDE_RET_LDO_OL</name>
                <description>This register should be set to override the HW generated RET_LDO_OL_HV to CYBLERD55. When set CLK_EN is used.</description>
                <bitRange>[25:25]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RET_LDO_OL</name>
                <description>Overrie value for CYBLERD55 RET_LDO_OL_HV</description>
                <bitRange>[26:26]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_POR_HV</name>
                <description>Reset for HVLDO
1'b1 - HVLDO Disabled
1'b0 - HVLDO Enabled</description>
                <bitRange>[27:27]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MT_DELAY_CFG</name>
            <description>MT Delay configuration for state transitions</description>
            <addressOffset>0xA4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>HVLDO_STARTUP_DELAY</name>
                <description>This register specifies the startup delay for the HVLDO interms of number of LF Clock cycles. FW has to program this register based on the selected LF clock frequency</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ISOLATE_DEASSERT_DELAY</name>
                <description>This register specifies the time from switching the CYBLERD55 logic to Active regulator to removal of ISOLATE_N</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACT_TO_SWITCH_DELAY</name>
                <description>This register specifies the time from assertion of ISOLATE_N to switching the CYBLERD55 logic to Retention LDO</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>HVLDO_DISABLE_DELAY</name>
                <description>This register specifies the time from disabling XTAL to switching of the HVLDO.</description>
                <bitRange>[31:24]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MT_DELAY_CFG2</name>
            <description>MT Delay configuration for state transitions</description>
            <addressOffset>0xA8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>OSC_STARTUP_DELAY_LF</name>
                <description>This register specifies the time for OSC Startup. After this delay, clock is enabled to the link layer. Clock is enabled after OSC_STARTUP_DELAY + 1 LF clock cycles. If PSoC was in DPSLP when XTAL is enabled, then the wakeup delay will be OSC_STARTUP_DELAY +  1 + PSoC Wakeup time. Minimum value to be programmed in 1. This is equivalent to Link Layer register WAKEUP_CONFIG.OSC_STARTUP_DELAY, but is specified in LF cycles</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DSM_OFFSET_TO_WAKEUP_INSTANT_LF</name>
                <description>This register specifies the pre-processing time required in Link Layer. This is esentially the time from CLK_EN (ungating clock in CYBLERD55) to the time when logic in CYBLERD55 is switched to Active mode Regulator.The delay is in terms of LF Clock cycles. FW has to program this register based on the selected LF clock frequency. This is equivalent to Link Layer register WAKEUP_CONFIG.DSM_OFFSET_TO_WAKEUP_INSTANT_LF, but is specified in LF cycles.</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACT_STARTUP_DELAY</name>
                <description>This register specifes the Active Regulator startup time in CYBLERD55. The delay is in terms of LF Clock cycles. FW has to program this register based on the selected LF clock frequency. The digital LDO will be turned on after this time elapses</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIG_LDO_STARTUP_DELAY</name>
                <description>This register specifes the Digital LDO startup time in CYBLERD55.The delay is in terms of LF Clock cycles. FW has to program this register based on the selected LF clock frequency. The logic in CYBLERD55 is switched to Active mode Regulator after this  (ACT_STARTUP_DELAY + DIG_LDO_STARTUP_DELAY)</description>
                <bitRange>[31:24]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MT_DELAY_CFG3</name>
            <description>MT Delay configuration for state transitions</description>
            <addressOffset>0xAC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFF</resetMask>
            <fields>
              <field>
                <name>XTAL_DISABLE_DELAY</name>
                <description>This register specifies the time from switching of logic to Retention LDO in CYBLERD55 to XTAL Disable. This should include the post processing time
The delay is in terms of LF Clock cycles. FW has to program this register based on the selected LF clock frequency.
At the minimum XTAL_DISABLE_DELAY should be the sum of DIG_LDO_DISABLE_DELAY and the powerdown time of ACTIVE_LDO</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIG_LDO_DISABLE_DELAY</name>
                <description>This field holds the delay from the time of diabling Digital LDO to the time at which ACTIVE regulator is disabled</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VDDR_STABLE_DELAY</name>
                <description>This field holds the delay after HVLDO Startup to VDDR Stable. Refer to memo AKK-410</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MT_VIO_CTRL</name>
            <description>MT Configuration Register to control VIO switches</description>
            <addressOffset>0xB0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x3</resetMask>
            <fields>
              <field>
                <name>SRSS_SWITCH_EN</name>
                <description>Enable to turn on HVLDO (One leg)
1'b0 - Switch is turned off
1'b1 - Switch is turned on</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SRSS_SWITCH_EN_DLY</name>
                <description>Enable to turn on HVLDO (All legs). This must be enabled 64us after enabling SRSS_SWITCH_EN
1'b0 - Switch is turned off
1'b1 - Switch is turned on</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MT_STATUS</name>
            <description>MT Status Register</description>
            <addressOffset>0xB4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FF</resetMask>
            <fields>
              <field>
                <name>BLESS_STATE</name>
                <description>1'b0 - BLESS in DPSLP state
1'b1 - BLESS in ACTIVE state</description>
                <bitRange>[0:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>MT_CURR_STATE</name>
                <description>This register reflects the current state of the MT FSM
4'h0 - IDLE
4'h1 - BLERD_DEEPSLEEP
4'h2 - HVLDO_STARTUP
4'h3 - WAIT_CLK
4'h4 - BLERD_IDLE
4'h5 - SWITCH_EN
4'h6 - ACTIVE
4'h7 - ISOLATE
4'h8 - WAIT_IDLE
4'h9 - XTAL_DISABLE
4'hA - HVLDO_DISABLE</description>
                <bitRange>[4:1]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>HVLDO_STARTUP_CURR_STATE</name>
                <description>This register reflects the current state of the HVLDO Startup FSM
3'h0 - HVLDO_OFF
3'h1 - HVLDO_WAIT
3'h2 - HVLDO_SAMPLE
3'h3 - HVLDO_ENABLED
3'h4 - HVLDO_SET_BYPASS</description>
                <bitRange>[7:5]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>LL_CLK_STATE</name>
                <description>This bit indicates when the Link Layer registers are accessible upon a DSM exit. This bit should not be used after a DSM entry command has been issued. 
1'b0 - Link Layer clock is not available
1'b1 - Link Layer clock is active</description>
                <bitRange>[8:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PWR_CTRL_SM_ST</name>
            <description>Link Layer Power Control FSM Status Register</description>
            <addressOffset>0xB8</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>PWR_CTRL_SM_CURR_STATE</name>
                <description>This register reflects the current state of the LL Power Control FSM
4'h0 - IDLE
4'h1 - SLEEP
4'h2 - DEEP_SLEEP
4'h4 - WAIT_OSC_STABLE
4'h5 - INTR_GEN
4'h6 - ACTIVE
4'h7 - REQ_RF_OFF</description>
                <bitRange>[3:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HVLDO_CTRL</name>
            <description>HVLDO Configuration register</description>
            <addressOffset>0xC0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x8000005F</resetMask>
            <fields>
              <field>
                <name>ADFT_EN</name>
                <description>ADFT enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ADFT_CTRL</name>
                <description>ADFT select</description>
                <bitRange>[4:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>VREF_EXT_EN</name>
                <description>Vref ext input enable.</description>
                <bitRange>[6:6]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>STATUS</name>
                <description>hvldo LV detect status</description>
                <bitRange>[31:31]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MISC_EN_CTRL</name>
            <description>Radio Buck and Active regulator enable control</description>
            <addressOffset>0xC4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x8</resetValue>
            <resetMask>0x1F</resetMask>
            <fields>
              <field>
                <name>BUCK_EN_CTRL</name>
                <description>Buck enable control. This must be programmed before enabling the Radio.
1'b1 - Buck enable output to radio is tied to 0
1'b0 - Buck enable output to radio is controlled from Mode transition FSM</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ACT_REG_EN_CTRL</name>
                <description>Active regulator enable control. This must be programmed before enabling the Radio.
1'b0 - Active regulator enable output to radio is tied to 0
1'b1 - Active regulator enable output to radio is controlled from Mode transition FSM</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LPM_DRIFT_EN</name>
                <description>Controls the LPM drift calculation.
1 - Enables the LPM drift mod
0 - Disables the LPM drift mod</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LPM_DRIFT_MULTI</name>
                <description>Controls the LPM drift multi level compensation.
1 - Enables the LPM drift multi comp
0 - Disables the LPM drift multi comp</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>LPM_ENTRY_CTRL_MODE</name>
                <description>Controls the LPM entry control mode
1 - LPM can be entered in the same slot as the previous LPM exit
0 - LPM must not be entered in the same slot or the subsequent slot as the last LPM exit</description>
                <bitRange>[4:4]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
