RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb-pdl-cat1/devices/COMPONENT_CAT1A/svd/psoc6_01.svd
          <register>
            <name>EFUSE_CONFIG</name>
            <description>EFUSE mode configuration register</description>
            <addressOffset>0xD0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>EFUSE_MODE</name>
                <description>This register enables the efuse mode in m0s8bless_ver3</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EFUSE_READ</name>
                <description>This bit when set by firmware enables the read from EFUSE macro. It is cleared when the efuse read is completed</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>EFUSE_WRITE</name>
                <description>This bit when set by firmware enables the write to EFUSE macro. It is cleared when the efuse write is completed</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_TIM_CTRL1</name>
            <description>EFUSE  timing control register  (common for Program and Read modes)</description>
            <addressOffset>0xD4</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x111201C0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>SCLK_HIGH</name>
                <description>Decides the duration of TPGM (in Program mode) or TCKHP (in Read mode)
TPGM: Burning Time
TCKHP : SCLK high Period</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>SCLK_LOW</name>
                <description>Duration of SCLK LOW (TCLKP_R) or TCKLP_P</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CS_SCLK_SETUP_TIME</name>
                <description>This register specifies the setup time between CS and SCLK (TSR_CLK)</description>
                <bitRange>[19:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CS_SCLK_HOLD_TIME</name>
                <description>This register specifies the hold time between CS and SCLK
(THR_CLK)</description>
                <bitRange>[23:20]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RW_CS_SETUP_TIME</name>
                <description>This field decides setup time between RW &amp; CS (TSR_RW: in read mode) or RW &amp; AVDD (TSP_RW: in Program mode).
TSR_RW: RW to CS setup time into Read mode 
TSP_RW: RW to AVDD setup time into program mode</description>
                <bitRange>[27:24]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>RW_CS_HOLD_TIME</name>
                <description>This field decides hold time between RW &amp; CS (THR_RW: in read mode) or RW &amp; AVDD (THP_RW: in Program mode).
THR_RW: RW to CS hold time out of Read mode 
THP_RW: RW to AVDD hold time out of program mode</description>
                <bitRange>[31:28]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_TIM_CTRL2</name>
            <description>EFUSE timing control Register (for Read)</description>
            <addressOffset>0xD8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x102</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>DATA_SAMPLE_TIME</name>
                <description>This register specifies the time for data sampling from SCLK HIGH
(TCKDQ_H)</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DOUT_CS_HOLD_TIME</name>
                <description>Wait time 
DOUT to CS hold time out of read mode (TDQH)</description>
                <bitRange>[11:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_TIM_CTRL3</name>
            <description>EFUSE timing control Register (for Program)</description>
            <addressOffset>0xDC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x3A3A11</resetValue>
            <resetMask>0xFFFFFF</resetMask>
            <fields>
              <field>
                <name>PGM_SCLK_SETUP_TIME</name>
                <description>PGM to SCLK setup time (TS_PGM)
PGM_SCLK_SETUP_TIME &lt;CS_SCLK_SETUP_TIME</description>
                <bitRange>[3:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PGM_SCLK_HOLD_TIME</name>
                <description>PGM to SCLK hold time (TH_PGM)</description>
                <bitRange>[7:4]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AVDD_CS_SETUP_TIME</name>
                <description>AVDD to CS setup time into program mode (TSP_AVDD_CS)</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AVDD_CS_HOLD_TIME</name>
                <description>AVDD to CS hold time out of program mode (THP_AVDD_CS)</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_RDATA_L</name>
            <description>EFUSE Lower read data</description>
            <addressOffset>0xE0</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>This register has the read value from the Efuse macro, fuse bits[31:0]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_RDATA_H</name>
            <description>EFUSE higher read data</description>
            <addressOffset>0xE4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>This register has the read value from the Efuse macro, fuse bits[63:32]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_WDATA_L</name>
            <description>EFUSE lower write word</description>
            <addressOffset>0xE8</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>This register has the write value to the Efuse macro, fuse bits[31:0]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>EFUSE_WDATA_H</name>
            <description>EFUSE higher write word</description>
            <addressOffset>0xEC</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>DATA</name>
                <description>This register has the write value to the Efuse macro, fuse bits[63:32]</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIV_BY_625_CFG</name>
            <description>Divide by 625 for FW Use</description>
            <addressOffset>0xF0</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFF02</resetMask>
            <fields>
              <field>
                <name>ENABLE</name>
                <description>This bit enables the divider for use by FW
1'b0 - divider used by LL
1'b1 - divider can be used by FW
This divider can only be used in MMMS mode. Do not enable for legacy operation</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIVIDEND</name>
                <description>This field holds the dividend</description>
                <bitRange>[23:8]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>DIV_BY_625_STS</name>
            <description>Output of divide by 625 divider</description>
            <addressOffset>0xF4</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x100</resetValue>
            <resetMask>0x3FF3F</resetMask>
            <fields>
              <field>
                <name>QUOTIENT</name>
                <description>Quotient value from the divider. Available 1 cycle after dividend is programmed.</description>
                <bitRange>[5:0]</bitRange>
                <access>read-only</access>
              </field>
              <field>
                <name>REMAINDER</name>
                <description>Remainder value from the divider. Available 1 cycle after dividend is programmed.</description>
                <bitRange>[17:8]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKET_COUNTER0</name>
            <description>Packet counter 0</description>
            <addressOffset>0x100</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>PACKET_COUNTER_LOWER</name>
                <description>Lower 32-bits of the packet counter value passed as part of Nonce for the packet to be encrypted.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>PACKET_COUNTER2</name>
            <description>Packet counter 2</description>
            <addressOffset>0x104</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFF</resetMask>
            <fields>
              <field>
                <name>PACKET_COUNTER_UPPER</name>
                <description>Upper 8 bits of the packet counter value passed as part of Nonce for the packet to be encrypted.</description>
                <bitRange>[7:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IV_MASTER0</name>
            <description>Master Initialization Vector 0</description>
            <addressOffset>0x108</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IV_MASTER</name>
                <description>This is the IVm field, which contains the master's portion of the initialization vector.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>IV_SLAVE0</name>
            <description>Slave Initialization Vector 0</description>
            <addressOffset>0x10C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>IV_SLAVE</name>
                <description>This is the IVs field, which contains the slave's portion of the initialization vector.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>ENC_KEY[%s]</name>
            <description>Encryption Key register 0-3</description>
            <addressOffset>0x110</addressOffset>
            <size>32</size>
            <access>write-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>ENC_KEY</name>
                <description>The encryption key / session key which is used in ECB encryption, CCM encryption and CCM decryption.</description>
                <bitRange>[31:0]</bitRange>
                <access>write-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC_IN0</name>
            <description>MIC input register</description>
            <addressOffset>0x120</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MIC_IN</name>
                <description>This is the MIC field used for CCM decryption.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>MIC_OUT0</name>
            <description>MIC output register</description>
            <addressOffset>0x124</addressOffset>
            <size>32</size>
            <access>read-only</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>MIC_OUT</name>
                <description>This is the MIC generated during CCM encryption.</description>
                <bitRange>[31:0]</bitRange>
                <access>read-only</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_PARAMS</name>
            <description>Encryption Parameter register</description>
            <addressOffset>0x128</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFF</resetMask>
            <fields>
              <field>
                <name>DATA_PDU_HEADER</name>
                <description>LLID of the packet.</description>
                <bitRange>[1:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PAYLOAD_LENGTH_LSB</name>
                <description>Length of the input data.</description>
                <bitRange>[6:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DIRECTION</name>
                <description>The directionBit shall be set to '1' for Data Channel PDUs sent by the master and set to '0' for Data Channel PDUs sent by the slave.</description>
                <bitRange>[7:7]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PAYLOAD_LENGTH_LSB_EXT</name>
                <description>3 Most significant bits of the LS byte of the length of the input data. Valid only when DLE is enabled. 
When DLE is enabled total ENC payload length = {PAYLOAD_LENGTH_LSB_EXT, PAYLOAD_LENGTH_LSB}</description>
                <bitRange>[10:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>MEM_LATENCY_HIDE</name>
                <description>Controls the encryption memory access mode. Valid only when DLE is enabled. 
0 - The AES is idle while memory fetch/store in progress.
1- The AES is pipelined while memory fetch/store in progress.</description>
                <bitRange>[11:11]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_CONFIG</name>
            <description>Encryption Configuration</description>
            <addressOffset>0x12C</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x1FFFF07</resetMask>
            <fields>
              <field>
                <name>START_PROC</name>
                <description>1 Start the AES processing</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ECB_CCM</name>
                <description>0 - CCM
1 - ECB</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>DEC_ENC</name>
                <description>Decryption/Encryption
0 - Encrypt
1 - Decrypt</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>PAYLOAD_LENGTH_MSB</name>
                <description>MS byte of the length of the input data when B0 needs to be completely configurable. Valid only when AES_B0_DATA_OVERRIDE is enabled. 
When AES_B0_DATA_OVERRIDE is enabled total ENC payload length = {PAYLOAD_LENGTH_MSB, PAYLOAD_LENGTH_MSB, PAYLOAD_LENGTH}</description>
                <bitRange>[15:8]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>B0_FLAGS</name>
                <description>LS byte of the input data when B0 needs to be completely configurable. Valid only when AES_B0_DATA_OVERRIDE is enabled.</description>
                <bitRange>[23:16]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>AES_B0_DATA_OVERRIDE</name>
                <description>Configuration to use B0 DATA provided by FW for CCM computation</description>
                <bitRange>[24:24]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_INTR_EN</name>
            <description>Encryption Interrupt enable</description>
            <addressOffset>0x130</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0x7</resetMask>
            <fields>
              <field>
                <name>AUTH_PASS_INTR_EN</name>
                <description>Authentication interrupt enable
0 - Disable
1 - Enable</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ECB_PROC_INTR_EN</name>
                <description>ECB processed interrupt enable
0 - Disable
1 - Enable</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CCM_PROC_INTR_EN</name>
                <description>CCM processed interupt enable
0 - Disable
1 - Enable</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>ENC_INTR</name>
            <description>Encryption Interrupt status and clear register</description>
            <addressOffset>0x134</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xF</resetMask>
            <fields>
              <field>
                <name>AUTH_PASS_INTR</name>
                <description>Authentication interrupt.
0x1- indicates MIC matched
0x0 -indicated MIC mismatched
Writing 1 to this register clears the interrupt.</description>
                <bitRange>[0:0]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>ECB_PROC_INTR</name>
                <description>ECB processed interrupt.
Writing 1 to this register clears the interrupt.</description>
                <bitRange>[1:1]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>CCM_PROC_INTR</name>
                <description>CCM processed interrupt.
Writing 1 to this register clears the interrupt</description>
                <bitRange>[2:2]</bitRange>
                <access>read-write</access>
              </field>
              <field>
                <name>IN_DATA_CLEAR</name>
                <description>Clears the input data. Used for Zero padding of encryption for less than block sized data.</description>
                <bitRange>[3:3]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <dim>4</dim>
            <dimIncrement>4</dimIncrement>
            <name>B1_DATA_REG[%s]</name>
            <description>Programmable B1 Data register (0-3)</description>
            <addressOffset>0x140</addressOffset>
            <size>32</size>
            <access>read-write</access>
            <resetValue>0x0</resetValue>
            <resetMask>0xFFFFFFFF</resetMask>
            <fields>
              <field>
                <name>B1_DATA</name>
                <description>Programmable B1 Data register</description>
                <bitRange>[31:0]</bitRange>
                <access>read-write</access>
              </field>
            </fields>
          </register>
